000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Корзина</name>
      <description>КОРЗИНА</description>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
    <items>
      <name>Производители</name>
      <description>Производители</description>
    </items>
  </predefined>
  <attributes>
    <name>Архивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументУдостоверяющийЛичность</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИзменения</name>
    <comment>NAV: timestamp</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоЕДРПОУ</name>
    <comment>(Регл) Код по ЕДРПОУ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСвидетельстваПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <comment>LNK. Может выступать в роли покупателя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>LNK. Может выступать в роли поставщика</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПрямуюЗакупку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаСобственности</name>
    <type>
      <types>CatalogRef.ФормаСобственности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Дети</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Пол</name>
      <type>
        <types>EnumRef.ПолФизическогоЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МаркетинговыеГруппы</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.МаркетинговыеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Контрагенты/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

//	Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда

		Возврат;

	КонецЕсли;

//	Обработчик подсистемы "Внешние обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);

//	LNK 02.10.2016 12:32:18
	ИменаОтбора = Новый Массив;
	ИменаОтбора.Добавить("Покупатель");
	ИменаОтбора.Добавить("Поставщик");

	Для каждого ИмяОтбора Из ИменаОтбора Цикл

		Если Параметры.Свойство(ИмяОтбора) Тогда

			Параметры.Отбор.Вставить(ИмяОтбора, Параметры[ИмяОтбора]);

		КонецЕсли;

	КонецЦикла;
	
	Если Параметры.Свойство("Заголовок", Заголовок) Тогда

		АвтоЗаголовок = Ложь;

	КонецЕсли;

	Если УправлениеПользователями.ПолучитьБулевоЗначениеПраваПользователя("АдминистраторПолномочный", Ложь) = Истина Тогда

		Элементы.Список.Вывод = ИспользованиеВывода.Авто;

	КонецЕсли;
	Если РольДоступна(Метаданные.Роли.АдминистраторСистемы) или РольДоступна(Метаданные.Роли.ДобавлениеИзменениеИнформацииПоКонтрагентам) тогда
		Элементы.ГруппаЮрЛицо.Видимость = Истина;
	Иначе
		Элементы.ГруппаЮрЛицо.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте	//	LNK 27.04.2020 07:28:24
Процедура ПриОткрытии(Отказ)

	УстановитьОформлениеЭлементовФормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КлючРеквизитаПриИзменении(Элемент)

	ЗначениеРеквизита = "";
	ЗначениеРеквизитаНаСервере();

	УстановитьОформлениеЭлементовФормы();

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаПриИзменении(Элемент)

	Если ЗначениеРеквизитаНаСервере() Тогда

		ПоказатьОповещениеПользователя("Найден " + ЗначениеРеквизита,, "Список позиционирован на элементе «" + Элементы.Список.ТекущаяСтрока + "»", БиблиотекаКартинок.Информация32);

		СпискиВыбораКлиентСервер.ОбновитьСписокВыбора(Элементы.ЗначениеРеквизита.СписокВыбора, ЗначениеРеквизита);
		СпискиВыбораКлиентСервер.Сохранить("ЗначениеРеквизитаКонтрагенты.Список." + Формат(КлючРеквизита, "ЧЦ=4; ЧН=0000; ЧВН=; ЧГ="), Элементы.ЗначениеРеквизита.СписокВыбора);

	ИначеЕсли НЕ ПустаяСтрока(ЗначениеРеквизита) Тогда

		ПоказатьОповещениеПользователя("Не найден!",, "Реквизит " + СокрЛП(ЗначениеРеквизита) + " не удалось обнаружить в справочнике.", БиблиотекаКартинок.Ошибка32);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаОчистка(Элемент, СтандартнаяОбработка)

	ЗначениеРеквизитаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаОткрытие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ЗначениеРеквизитаНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	СпискиВыбораКлиентСервер.АвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);

КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере	//	LNK 23.04.2020 15:03:33
Функция ЗначениеРеквизитаНаСервере()

	Если ПустаяСтрока(ЗначениеРеквизита) Тогда

		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
			Список, 
			"Ссылка", 
			, 
			Ложь
		);
		Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;

		Возврат Ложь;

	КонецЕсли;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаКонтакты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК ТаблицаКонтакты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &КлючРеквизита = 0
	|				ТОГДА ТаблицаКонтакты.НомерТелефона = &ЗначениеРеквизита
	|						И ТаблицаКонтакты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|			ИНАЧЕ ТаблицаКонтакты.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|					И (ТаблицаКонтакты.АдресЭП = &ЗначениеРеквизита
	|						ИЛИ ТаблицаКонтакты.Представление = &ЗначениеРеквизита)
	|		КОНЕЦ"
	);
	Запрос.УстановитьПараметр("КлючРеквизита"    , КлючРеквизита);
	Запрос.УстановитьПараметр("ЗначениеРеквизита", ?(КлючРеквизита = 0, ОтправкаSMS.ПодготовитьНомерТелефона(ЗначениеРеквизита), ЗначениеРеквизита));
	
	Результат = Запрос.Выполнить();
	Найден    = НЕ Результат.Пустой();

	Если Найден Тогда

		СписокСсылок = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");

		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
			Список, 
			"Ссылка", 
			СписокСсылок, 
			Истина,
			ВидСравненияКомпоновкиДанных.ВСписке
		);
		Элементы.Список.ТекущаяСтрока = СписокСсылок[0];
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;

	Иначе

		ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
			Список, 
			"Ссылка", 
			, 
			Ложь
		);
		Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;

	КонецЕсли;

	Возврат Найден;

КонецФункции

&НаКлиенте
Процедура УстановитьОформлениеЭлементовФормы()

	Если КлючРеквизита = 0 Тогда

		Элементы.ЗначениеРеквизита.Маска          = "+380 99 999 99 99";
		Элементы.ЗначениеРеквизита.ПодсказкаВвода = "+380 99 999 99 99";

	Иначе

		Элементы.ЗначениеРеквизита.Маска          = "";
		Элементы.ЗначениеРеквизита.ПодсказкаВвода = "joker@gmail.com";

	КонецЕсли;

	СпискиВыбораКлиентСервер.Загрузить("ЗначениеРеквизитаКонтрагенты.Список." + Формат(КлючРеквизита, "ЧЦ=4; ЧН=0000; ЧВН=; ЧГ="), Элементы.ЗначениеРеквизита.СписокВыбора);

КонецПроцедуры

#КонецОбласти
